Revit 2027 API
FilteredWorksetIterator.GetCurrent Method
 The current workset found by the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Workset GetCurrent()
Public Function GetCurrent As Workset
public:
Workset^ GetCurrent()
member GetCurrent : unit -> Workset
Return Value
Workset
 The workset.
Exceptions
Exception | Condition
InvalidOperationException |  There are no more worksets in the iterator. -or- The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator.
See Also
Reference
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace